"""
1) Создать список и заполнить его элементами различных типов данных.
Реализовать скрипт проверки типа данных каждого элемента. Использовать
функцию type() для проверки типа. Элементы списка можно не запрашивать
у пользователя, а указать явно, в программе.
"""
# my_list = [1, "Привет", True, [1, 2, 3], None]
# my_list = list()
# my_list = []
# my_list.append(1)
# my_list.append("Привет")
# my_list.append(True)
# my_list.append([1, 2, 3])
# my_list.append(None)
#
#
# def check_type(array):
#     """checking the type of each element"""
#     i = 0
#     for el_arr in array:
#         print(f'{i} элемент имеет тип: {type(el_arr)}"')
#         i += 1
#
# check_type(my_list)
